In [1]:
import csv

with open(file="try.csv", mode="r") as f:
    reader = csv.DictReader(f)
    for row in reader:
        print(row["Name"], " ", row["Address"])

Ram   Dharan
Shyam   Brt
Gita   Ktm

In [2]:
import csv

data = [
    ['Name', 'Address', 'Age'],
    ['Ram', 'Dharan', 22],
    ['Shyam', 'Brt', 24],
    ['Sita', 'Ktm', 21]
]

# Writing to CSV file
with open("newcsv.csv", "w", newline="") as f:
    writer = csv.writer(f)
    writer.writerows(data)

print("CSV file created successfully!")

CSV file created successfully!

In [4]:
import csv

data = [
    {'Name': 'Ram', 'Address': 'Dharan', 'Age': 22},
    {'Name': 'Shyam', 'Address': 'Brt', 'Age': 23},
    {'Name': 'Sita', 'Address': 'Ktm', 'Age': 24},
]

with open("newnew.csv", "w", newline="") as f:
    writer = csv.DictWriter(f, fieldnames=["Name", "Address", "Age"])
    writer.writeheader()       # writes the header row
    writer.writerows(data)     # writes all dictionary rows

print("CSV file created successfully!")

CSV file created successfully!

In [5]:
import pandas as pd

df = pd.read_csv("newnew.csv")

print(df)

print(type(df))

    Name Address  Age
0    Ram  Dharan   22
1  Shyam     Brt   23
2   Sita     Ktm   24
<class 'pandas.core.frame.DataFrame'>

In [8]:
df.head()

    Name Address  Age
0    Ram  Dharan   22
1  Shyam     Brt   23
2   Sita     Ktm   24

In [9]:
df.tail()

    Name Address  Age
0    Ram  Dharan   22
1  Shyam     Brt   23
2   Sita     Ktm   24

In [10]:
df.isnull()

    Name  Address    Age
0  False    False  False
1  False    False  False
2  False    False  False

In [ ]:
import pandas as pd

# Create DataFrame with student marks
new_df = pd.DataFrame([
    {'Roll': 1, 'Name': 'Ram', 'Eng': 80, 'Sci': 97, 'Math': 94},
    {'Roll': 2, 'Name': 'Shyam', 'Eng': 75, 'Sci': 88, 'Math': 90},
    {'Roll': 3, 'Name': 'Sita', 'Eng': 85, 'Sci': 92, 'Math': 89}
])

new_df['Total'] = new_df[['Eng', 'Sci', 'Math']].sum(axis=1)
new_df['Percentage'] = (new_df['Total'] / 3).round(2)

print(new_df)

   Roll   Name  Eng  Sci  Math  Total  Percentage
0     1    Ram   80   97    94    271       90.33
1     2  Shyam   75   88    90    253       84.33
2     3   Sita   85   92    89    266       88.67

In [7]:
import pandas as pd

# Create DataFrame from a list of dictionaries
dataframe = pd.DataFrame([
    {"Name": "Alice", "Age": 25},
    {"Name": "Bob", "Age": 28}
])

# Save to CSV
dataframe.to_csv("output.csv", index=False)

print(dataframe)

    Name  Age
0  Alice   25
1    Bob   28